import { Injectable } from '@angular/core';
import { BookItem } from './books-page';

@Injectable({
  //Injectable?
  //یعنی این میشه بهش وابسته شد
  providedIn: 'root',
})

// این Decoration که قبل کلاس زیر امده باعث میشه که این کلاس یک سرویس باشه
// که قبل کلاس بیاد باعث میشه کلاس یک کلاس باشه Decoration @Component

export class BooksService {

  //private در خط زیر یعنی خارج از این سرویس در دسترس نباشد
    private data:BookItem[]=[
    {id:1,title:'کیمیاگر',writer:'پائولو',publisher:'انتشاراتی مجید',price:190000},
    {id:2,title:'نشخوار ذهنی',writer:'ایتن کراس',publisher:'سراج بوک',price:170000},
    {id:3,title:'دختر پرتغالی',writer:'یوستین',publisher:'یوشیتا',price:220000},
  ];
  
  //تابعی است که لیست کتاب ها رو تحویل میدهد
  //فعلا با داده های ماک کار میکند اما در اینده باید از بک اند داده دریافت کند
  list(){
    return[...this.data]
    
    //...this.data
    //یعنی کپی از دیتا در قالب یک ارایه جدید که نمایش داده بشه
  }
  
  // این یک تابع است که کتابی را به عنوان پارامتر دریافت و به لیست کتاب‌هااضافه ميكند
  // فعلا به داده ماک اضافه میکند
  add(item:BookItem){
    this.data.push(item);
  }
}





//كلاس در آنگولار چیه و چی کار میکنه؟
// سرویس در آنگولار یک کلاسیه که برای منطقه یا داده ها بین کامپوننت ها به کار میره
// در واقع سرویس ها به شما کمک می‌کنه که کد رو به صورت تمیز و مجزا سازمان دهی کنید و قابلیت استفاده مجدد از کد رو افزایش بدید

//سرویس ها توی آنگولار میتونن داده ها رو بین كامپوننت های مختلف به اشتراک بزارن و این باعث میشه که کامپوننت ها بتونن از یک منبع مشترک استفاده کنن

//یكی از مزیت های سرویس ها اینکه داده هاشون با جا به جایی بین کامپوننت ها یا حتی  تغییر در بخش های مختلف نرم افزار همچنان حفظ میشوند از بین نمی‌روند

//سرویس ها میتونن هم با داده های ماک کار كنن و هم به بک اند واقعی متصل بشن این انعطاف بهتون اجازه میده که نرم افزارتون رو راحت تر توسعه بدید

//میتونیم با استفاده از سرویس توی آنگولار وانمود کنیم که انگار داریم با بک اند واقعی کار میکنم و وقتی تیم بک اند آماده شد فقط همون سرویس ها رو به بک اند وصل کنیم
// این باعث میشه تغییرات خیلی راحت تر و منظم تر انجام بشه

//توی آنگولار یه مفهوم خیلی مهم به اسم تریق وابستگی Dependency injection ه‍ست که باعث میشه مدیریت وابستگی‌ها و حافظه توی برنامه وب خیلی بهتر منظم تر انجام بشه
//میتونیم اینطور بگیم که توی آنگولار Dependency injection یک جورایی جای ترکیب اون شی گرایی سنتی گرفته و این کمک می‌کنه مدیریت وابستگی‌ها توی پروژه خیلی ساده تر بشه